---
title: RebarContainerIterator
classe: Autodesk.Revit.DB.Structure.RebarContainerIterator
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# RebarContainerIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `RebarContainerItem Current { get; }` | `rebarContainerIterator.Current` | RebarContainerItem |
| `Boolean IsValidObject { get; }` | `rebarContainerIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `rebarContainerIterator.Dispose()` | Void |
| `Boolean MoveNext()` | `rebarContainerIterator.MoveNext()` | Boolean |
| `Void Reset()` | `rebarContainerIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```